# BoltSpacingBetweenRows Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionIWideFlange..::..BoltSpacingBetweenRows Property
StructuralSectionIWideFlange Class See Also
---
Standard bolt spacing between rows, in. (mm)
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double BoltSpacingBetweenRows { get; set; }
```

Visual Basic
---
```text
Public Property BoltSpacingBetweenRows As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BoltSpacingBetweenRows {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionIWideFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace